Revit 2016 API
BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch Property
 Bend profile is empty. Cannot create a bent fabric sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetEmptySketch { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetEmptySketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetEmptySketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace